python, numpy, pandas 날짜 타입 비교 및 정리

- datetime은 python 설치 시 기본적으로 내장된 라이브러리로, 날짜를 쓸 것인지, 시간을 쓸 것인지, 날짜시간을 합쳐쓸 것인지에 따라 클래스가 분화되어 있는 것이 특징. 예를들어 '2021-3-16'을 표시하고 싶으면 date 클래스를 사용하고, '2021-3-16 12:34:21'를 표시하고 싶으면 'datetime' 클래스를 사용합니다. 
- 반면 datetime64나 Timestamp는 각각 numpy, pandas 라이브러리에서 새로 정의한 날짜시간 클래스입니다. 이 둘은 numpy, pandas를 설치해야만 이용할 수 있고, 한 클래스로 날짜, 시간, 날짜시간을 모두 정의할 수 있는 것이 특징
- 날짜, 시간 타입은 일반적인 정수, 실수끼리 연산할 때와 달리 단위를 가지고 있는 점 때문에 시간의 차이를 저장하는 별도의 클래스가 있다는 특징. 이를 timedelta(타임델타)라고 하는데, 날짜, 시간은 특정 시점의 시각을 표시하는 용도이고(2021년 3월 16일), 타임델타는 기간 또는 시간 차이를 표시하는 용도(5일)

- https://ellun.tistory.com/320

<img src='날짜타입.jpg' STYLE='width:500px;'>

#### 파이썬 날짜, 시간

In [6]:
# timestamp -> str
import time
t = time.time()
print(t,type(t))
s = str(time.time())
print(s,type(s))

1656550258.099913 <class 'float'>
1656550258.099913 <class 'str'>

In [11]:
# datetime -> str
from datetime import datetime
s = datetime.now()
print(s,type(s))
s1 = s.strftime('%Y-%m-%d %H:%M:%S')
print(s1,type(s1))

2022-06-30 10:16:32.682197 <class 'datetime.datetime'>
2022-06-30 10:16:32 <class 'str'>

In [13]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:13:58'
print(s,type(s))
d = datetime.strptime(s,'%Y-%m-%d %H:%M:%S')
print(d,type(d))

2021-07-20 11:13:58 <class 'str'>
2021-07-20 11:13:58 <class 'datetime.datetime'>

In [15]:
# str -> datetime -> timestamp
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S')
                        .timetuple())
print(timestamp,type(timestamp))

1626747238.0 <class 'float'>

In [22]:
# datetime -> timestamp
d = datetime.today()
print(d,type(d))
timestamp = time.mktime(d.timetuple())
print(timestamp, type(timestamp))

2022-06-30 10:26:16.091271 <class 'datetime.datetime'>
1656552376.0 <class 'float'>

In [26]:
# timestamp -> datetime
t = time.time()
print(t,type(t))
d = datetime.fromtimestamp(t)
print(d,type(d))

1656552451.7549145 <class 'float'>
2022-06-30 10:27:31.754915 <class 'datetime.datetime'>

#### 과제 (6/30)
- 현재시간을 불러와서 timestamp으로 불러와서 datetime, str로 타입을 변경한 후 다시 timestamp 으로 변경하세요.
- 원하는 날짜+시간을 5개 str로 만든 후 datetime, timestamp 타입으로 변경하세요.

In [29]:
# 1년전 datetime 값 
from datetime import timedelta
import time

datetime_now = datetime.now()
print(datetime_now)
delta_datetime = timedelta(days=-365)
print(delta_datetime)
datetime_now + delta_datetime

2022-06-30 10:35:50.067030
-365 days, 0:00:00

datetime.datetime(2021, 6, 30, 10, 35, 50, 67030)

In [31]:
# 두 날짜간의 일수 구하기
since_timestamp = datetime.strptime('20180301','%Y%m%d')
until_timestamp = datetime.strptime('20180331','%Y%m%d')
print(since_timestamp)
print(until_timestamp)
result = until_timestamp - since_timestamp
result

2018-03-01 00:00:00
2018-03-31 00:00:00

datetime.timedelta(days=30)

In [33]:
# 특정요일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()]
get_yoil(2022,6,30)

'THU'

In [34]:
# 판다스 to_datetime 
# 판다스에서는 파이썬의 datetime을 timestamp라고 함
import pandas as pd
pd.to_datetime(1656550258.099913,unit='s')

Timestamp('2022-06-30 00:50:58.099912960')

In [35]:
date = pd.Timestamp(1656550258.099913,unit='s',tz='Asia/Seoul')
print(date,type(date))

2022-06-30 09:50:58.099912882+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [40]:
import pandas as pd
df = pd.read_csv('stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [42]:
df['New_Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [ ]:
df.drop('Date',axis=1,inplace=True)

In [46]:
df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [47]:
df1 = df.copy()

In [49]:
df1.set_index('New_Date',inplace=True)
df1.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [50]:
df1.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [55]:
df1_ym = df1.loc['2018-07','Start':'Low']  #7월에 해당하는것만 검색
df1_ym

            Start   High    Low
New_Date
2018-07-02  10850  10900  10000

In [59]:
pd.date_range(start='2020-10-01',end='2020-10-10',periods=5)

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-03 06:00:00',
               '2020-10-05 12:00:00', '2020-10-07 18:00:00',
               '2020-10-10 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [67]:
# 수요일단위로 50개 날짜 찾기 특정기간부터
dates = pd.date_range('1/1/2000',periods=50,freq='W-WED') 
print(dates)

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13'],
              dtype='datetime64[ns]', freq='W-WED')

In [66]:
pd.date_range('2000-01-01','2000-01-02 23:59', freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00'],
              dtype='datetime64[ns]', freq='4H')